data/cfdb/verification/taylor_green_vortex/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// Analytic kinematic pressure at t = 0 (rho = 1):
//   p = -(U0^2 / 4) (cos(2 k x) + cos(2 k y)),  U0 = 1, k = 1.
// Same #codeStream mechanism as 0/U (non-root user, writable case dir).
internalField   #codeStream
{
    codeInclude
    #{
        #include "volFields.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lfiniteVolume
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());

        scalarField f(mesh.nCells());
        const vectorField& C = mesh.C();
        forAll(f, i)
        {
            f[i] = -0.25*(Foam::cos(2.0*C[i].x()) + Foam::cos(2.0*C[i].y()));
        }
        f.writeEntry("", os);
    #};
};

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
