data/cfdb/verification/taylor_green_vortex/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2D Taylor-Green vortex: domain [0, 2*pi] x [0, 2*pi], one cell in z.
// Periodic (cyclic) in x and y, empty front/back. 64x64x1 = 4096 cells
// (documented demo resolution; tolerances in case.yaml reflect this).

scale   1;

vertices
(
    (0                 0                 0)      // 0
    (6.283185307179586 0                 0)      // 1
    (6.283185307179586 6.283185307179586 0)      // 2
    (0                 6.283185307179586 0)      // 3
    (0                 0                 0.1)    // 4
    (6.283185307179586 0                 0.1)    // 5
    (6.283185307179586 6.283185307179586 0.1)    // 6
    (0                 6.283185307179586 0.1)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 64 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces
        (
            (2 6 5 1)
        );
    }
    bottom
    {
        type            cyclic;
        neighbourPatch  top;
        faces
        (
            (1 5 4 0)
        );
    }
    top
    {
        type            cyclic;
        neighbourPatch  bottom;
        faces
        (
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type            empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
